---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.WallSingleSlantAngleFromVertical
source: html/16d92d1c-9bb4-3a2c-b2d5-355e28fb2598.htm
---
# Autodesk.Revit.DB.ParameterTypeId.WallSingleSlantAngleFromVertical Property

"Angle From Vertical"

## Syntax (C#)
```csharp
public static ForgeTypeId WallSingleSlantAngleFromVertical { get; }
```